Tutoriels/overInterDyMFoam/faucetAndSink/backgroundMesh/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.01;

boundaryField
{
    overset1
    {
        type            overset;
    }

	inlet1
	{
        type        	turbulentIntensityKineticEnergyInlet;
        intensity   	0.05;           
        value       	uniform 0.01;      
	}

	outlet
	{
        type            inletOutlet;
		inletValue		$internalField;
		value			$internalField;
    }

    "(sink|faucet|inlet)"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
